app/Controllers/DashboardController.php

SELECT *
FROM `pedidos_estado`
WHERE `id` = 7126770450773
---
    private function obtenerEstadoInterno($orderId)
    {
        $db = \Config\Database::connect();

        $row = $db->table("pedidos_estado")
                 ->where("id", $orderId)
                 ->get()
                 ->getRow();